run/mycavity_decaySolute/0/molarConc
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      molarConc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0.0;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform 1000;
    }

    fixedWalls
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
