run/mycavity_decaySolute/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu                         [0 2 -1 0 0 0 0] 1.8e-5;
diffusionCoef              [0 2 -1 0 0 0 0] 1.0e-5;
decayRate                  [0 0 -1 0 0 0 0] -1.0;

// ************************************************************************* //
